kgun2g/somfy-rts-remote-by-thread/sdkconfig.defaults.h2_thread
# ──────────────────────────────────────────────────────────
# sdkconfig.defaults.h2_thread
#   ESP32-H2 보드용 sdkconfig defaults (Matter over Thread).
#   H2 는 802.15.4(Thread)+BLE 지원, WiFi 없음 → C6 와 동일 Thread 트랜스포트.
#   build.ps1 -Board esp32-h2 가 이 파일을 sdkconfig.defaults 와 함께 적용.
#
#   ★ 미검증 템플릿 — 실제 H2 보드로 첫 빌드 시 핀(boards/esp32-h2.h) 및
#     파티션/BSP 설정 재조정 필요.
# ──────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32h2"

# libsodium
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y

# NIMBLE (BLE — 커미셔닝)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=70
# ★★★2026-08-24 n → y. **이것 때문에 H2 는 light sleep 을 한 번도 못 했다.**
#  실측(배터리 13.9시간): sleep **0.0%**. 그런데 batlog 의 pm 열은 3
#  (= light sleep ON + 배터리) — 즉 esp_pm_configure 는 정상이었다.
#  NVS 로 받은 esp_pm_dump_locks 가 범인을 이름으로 찍어줬다:
#        Name  Type            Active  Total_count  Time(%)
#        bt    APB_FREQ_MAX      1          1        100%   ← 부팅부터 한 번 잡고 안 놓음
#        Mode: APB_MAX 94% / SLEEP 0%
#        light_sleep_counts:0  reject_counts:0       ← 시도조차 안 함
#  APB_FREQ_MAX 락이 걸려 있으면 automatic light sleep 은 진입 자체를 못 한다.
#
#  ★이건 **회귀가 아니라 적용 누락**이다. 2026-08-15 에 이미 같은 락을 찾아
#    이 옵션으로 고쳤는데, 그 수정이 **C6 오버레이(sdkconfig.defaults.xiao_c6)에만**
#    들어갔다. h2_thread/c6_thread 는 n 그대로였다.
#    → 보드별 오버레이 구조에서 "고쳤다"는 한 보드에서만 참일 수 있다.
#      공통 결함을 고치면 **모든 보드의 defaults 를 확인할 것.**
#
#  동작: 등록 완료 후 BLE deinit, 이미 provisioned 면 부팅 시 초기화조차 안 함.
#  ※대가: 이미 등록된 기기는 BLE 광고를 안 한다. 재페어링은 공장초기화(미등록
#    상태 복귀) 후에 하면 된다 — C6 는 2026-08-15 부터 이 설정으로 운용 중이고
#    문제가 없었다. heap 도 함께 회복된다(C6 때 164→184KB).
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=y

# Enable OpenThread (H2 는 802.15.4 라디오 내장)
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n

# Disable lwip ipv6 autoconfig
CONFIG_LWIP_IPV6_AUTOCONFIG=n

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# LwIP config for OpenThread
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y

# MDNS platform
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# Enable OTA Requestor
CONFIG_ENABLE_OTA_REQUESTOR=y

# H2 는 WiFi 없음 → STA 비활성
CONFIG_ENABLE_WIFI_STATION=n

# Button
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_LONG_PRESS_TIME_MS=5000

# ★★★2026-08-16 CHIP shell 끔 — **heap 확보**(사용자 선택 B: 블라인드 3개 유지).
#  실측: OLEDMON 의 free=esp_get_free_heap_size() 가 **2,060B** 였다. 그 결과
#    · CC1101 SPI 바운스 버퍼 할당 실패 → IDF 버그 경로로 패닉(coredump 로 확인)
#    · OLED 가 부팅 화면 1프레임(페이지 8개) 뒤로 갱신 불가 → "화면 멈춤"
#  H2 에서 콘솔은 **어차피 못 쓴다** — heap 부족으로 linenoise 4KB 할당이 실패하면
#  REPL 이 폭주해 somfy_app 을 굶기고 task_wdt 가 터진다(실측). 진단은 콘솔이 아니라
#  NVS 파티션 덤프로 읽는다(sim/tools/nvs_parse.py · batlog_decode.py · bootdiag_decode.py).
#  → 쓰지도 못하는 셸에 heap 을 낼 이유가 없다. C6 는 그대로 켜 둔다.
CONFIG_ENABLE_CHIP_SHELL=n

# ── mDNS 축소 — H2 에는 WiFi/이더넷 netif 가 **아예 없다**(Thread 전용) ──
#  기본값은 STA/AP/ETH 인터페이스를 전제로 구조체를 잡는다. 쓰지 않는 것을 끈다.
CONFIG_MDNS_PREDEF_NETIF_STA=n
CONFIG_MDNS_PREDEF_NETIF_AP=n
CONFIG_MDNS_PREDEF_NETIF_ETH=n
CONFIG_MDNS_MAX_INTERFACES=1
CONFIG_MDNS_MAX_SERVICES=2
CONFIG_MDNS_ENABLE_CONSOLE_CLI=n

# ── 그 외 소소한 확보 ──
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=16
CONFIG_MAX_EXCHANGE_CONTEXTS=4

# ── 콘솔: USB Serial JTAG 를 primary 로 (COM8 stdin 활성 → tx/sel 명령 입력 가능).
#    기본(UART0 primary)이면 USB JTAG 는 secondary=로그출력만·stdin 없음 → 명령 write 가
#    아무도 안 읽어 hang. primary 를 JTAG 로 바꿔 자동 테스트 하네스가 COM 으로 명령을 넣는다. ──
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# ── USB 연결 중 auto light sleep 금지 (★현재 H2 에서는 **작동하지 않는 예방책**) ──
#
#  전제: ESP32-H2 는 soc_caps.h 에서 SOC_USB_SERIAL_JTAG_SUPPORT_LIGHT_SLEEP 이 주석
#  처리(미지원)다 — light sleep 에 들어가면 USB-Serial-JTAG 이 죽어 로그도 esptool 도
#  응답하지 않는다. 이 옵션은 SOF 패킷으로 호스트 연결을 감지해
#  ESP_PM_NO_LIGHT_SLEEP 락을 잡아 그 상황을 막는다(배터리에서는 SOF 가 없어 락이
#  풀리므로 절전은 그대로다).
#
#  ★단, Kconfig 의 `depends on PM_ENABLE ...` 때문에 **지금은 무시된다** —
#    이 보드는 CONFIG_PM_ENABLE 이 꺼져 있어(생성된 sdkconfig 확인) auto light sleep
#    자체가 없다. 2026-08-16 기기 무응답(플래시 18회 실패)을 이 옵션 부재 탓으로
#    적었던 것은 **오진이었다** — PM 이 꺼져 있어 애초에 잠들 수 없다.
#    실제 복구는 전원 재투입이었다(부팅진단 56회차 `리셋사유=전원투입`).
#  → H2 에 PM 을 켜는 날 자동으로 효력이 생기도록 남겨 둔다.
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y

# ── SSD1306 OLED 컴포넌트 ──
# oled_ui.c 가 명시 핀을 직접 넘기므로 component Kconfig SCL/SDA 는 미사용.
CONFIG_I2C_INTERFACE=y
# CONFIG_SPI_INTERFACE is not set
# CONFIG_SSD1306_128x32 is not set
CONFIG_SSD1306_128x64=y
CONFIG_OFFSETX=28
# CONFIG_FLIP is not set
CONFIG_SCL_GPIO=13
CONFIG_SDA_GPIO=12
CONFIG_RESET_GPIO=-1
CONFIG_I2C_PORT_0=y
# CONFIG_LEGACY_DRIVER is not set

# ── Matter Time Synchronization 클러스터 ──
CONFIG_SUPPORT_TIME_SYNCHRONIZATION_CLUSTER=y

# ── Matter OTA: 보드별 고유 Product ID (OTA 이미지 보드 매칭용) ──
CONFIG_DEVICE_PRODUCT_ID=0x8001
CONFIG_BLE_DEVICE_NAME_PREFIX="MATTER-"
CONFIG_CHIP_PROJECT_CONFIG="main/CHIPProjectConfig.h"

# ── 기기 고유 커미셔닝: eFuse 기반 discriminator/passcode ──
CONFIG_CUSTOM_COMMISSIONABLE_DATA_PROVIDER=y

# ═══════════════════════════════════════════════════════════════════════════
#  ★★★2026-08-16 H2 절전 — C6 에 적용한 것이 H2 에는 **하나도 안 들어가 있었다**.
#
#  실측 근거: 방전 로그의 sleep 체류가 H2 는 **0.0%**, C6 는 85% 였다.
#  아래 세 단계를 **이 순서로** 넣는다(뒤 단계가 앞 단계에 의존한다).
# ═══════════════════════════════════════════════════════════════════════════

# ── ① Thread FTD → MTD/SED + Matter ICD  (효과 압도적) ──────────────────
#  FTD 는 다른 노드를 중계해야 해서 802.15.4 수신부를 못 끈다(~70mA 상시).
#  리모컨은 중계가 필요 없으므로 MTD + ICD 서버 = Sleepy End Device 로 만든다.
#  하향 명령은 **부모 라우터가 큐에 보관**하고 SLOW_POLL(7초)마다 받아온다
#  → 라디오를 꺼도 SmartThings 명령은 유실되지 않는다(지연만 최대 7초).
#  ★MTD 는 라우터 테이블이 없어 **RAM 도 덜 쓴다** — H2 heap 난에도 유리.
#  ★함정: ENABLE_ICD_SERVER 만 켜면 링크 실패
#    (undefined reference: MatterIcdManagementPluginServerInitCallback).
#    esp-matter 는 클러스터를 개별 선택하므로 SUPPORT_ICD_MANAGEMENT_CLUSTER 를
#    **짝으로** 켜야 한다(기본 sdkconfig.defaults 는 n 이라 여기서 덮는다).
# CONFIG_OPENTHREAD_FTD is not set
CONFIG_OPENTHREAD_MTD=y
CONFIG_ENABLE_ICD_SERVER=y
CONFIG_SUPPORT_ICD_MANAGEMENT_CLUSTER=y
CONFIG_ICD_SLOW_POLL_INTERVAL_MS=7000
CONFIG_ICD_FAST_POLL_INTERVAL_MS=200
#  IdleModeInterval 이 짧으면 SmartThings 가 기기를 offline 로 본다(커밋 07ba2af).
CONFIG_ICD_IDLE_MODE_INTERVAL_SEC=30

# ── ② FreeRTOS tick 100 → 1000 Hz  (③의 전제조건) ───────────────────────
#  100Hz 면 1 tick = 10ms 라 FREERTOS_IDLE_TIME_BEFORE_SLEEP(3 tick) 문턱이
#  **30ms** 인데, btn_handler 가 10~50ms 마다 깨워 문턱을 절대 못 넘는다
#  → light sleep 에 한 번도 못 들어간다(C6 에서 확인된 함정, 커밋 1bbcbc5).
#  ★RF 영향을 sim/tools/tick_rate_rf_sim.py 로 먼저 검증했다. 오히려 **개선**이다:
#    100Hz 에서는 pdMS_TO_TICKS(5) 가 0 tick 이라 somfy_rts.c 의 VCO/PA 안정화
#    대기 5ms 가 **실행되지 않고 있었다**(sim: settle 0ms / 5개 케이스 전부).
#    1000Hz 면 5ms 가 복원된다. 프레임 간 틈은 양쪽 다 0.00ms 로 동일.
CONFIG_FREERTOS_HZ=1000

# ── ③ 전력관리 (PM + tickless idle + 802.15.4 절전) ─────────────────────
#  코드는 이미 #if CONFIG_PM_ENABLE 로 준비돼 있어 설정만 켜면 동작한다
#  (somfy_app.c _enable_pm_light_sleep / _ls_exit_cb).
#  ★★★위 CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION 이 **여기서부터 유효해진다** —
#    그 옵션은 `depends on PM_ENABLE` 이라 지금까지 무시되고 있었다. H2 는
#    light sleep 에 들어가면 USB-Serial-JTAG 이 죽는데(soc_caps 미지원),
#    light sleep 허용 판단이 고장난 CHG_STAT 을 보므로 USB 에 꽂힌 채 잠들어
#    **플래시조차 불가능해진다**. SOF 기반 락이 그걸 막는다. 순서가 중요하다.
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_PM_SLP_IRAM_OPT=y
CONFIG_IEEE802154_SLEEP_ENABLE=y
#  방전 로그의 sleep% / 진입횟수 계측용(배터리에선 콘솔이 없어 NVS 로만 읽는다).
CONFIG_PM_LIGHT_SLEEP_CALLBACKS=y
#  ※PM_PROFILING 은 H2 에선 켜지 않는다 — 콘솔이 없어(heap) `pm` 을 못 쓴다.

# ── coredump: 패닉 backtrace 를 플래시에 저장 (partitions.csv 의 coredump 파티션) ──
#  H2 는 배터리 구동 중 콘솔이 없어 패닉 로그를 볼 방법이 전혀 없다. 이것만이
#  원인을 확정할 수단이다. 읽기는 콘솔 없이:
#     esptool read_flash 0x3EA000 0x10000 core.bin
#     espcoredump.py info_corefile -c core.bin build-esp32-h2/somfy_blinds.elf
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=32

# ═══ ★★★2026-08-16 heap 확보 — 채널(블라인드 3개)을 줄이지 않는 방법 ═══════
#  실측: OLEDMON 의 free heap 이 **1,324B**. 이 상태로는 BLE 페어링(PASE 피크
#  20~30KB)이 불가능하다. 가장 큰 덩어리를 추적하니 **NimBLE mbuf 풀이 heap**
#  에서 나온다(CONFIG_BT_NIMBLE_MSYS_BUF_FROM_HEAP=y):
#      MSYS_1: 24 × 128B = 3,072B      MSYS_2: 24 × 320B = 7,680B   합 10.7KB
#  기록된 진단("병목=NimBLE mbuf heap")과 일치한다.
#  → 이 기기는 **BLE peripheral 전용**(커미셔닝 때만 광고)이므로 아래를 줄인다.
#  ※너무 줄이면 BLE 처리량이 떨어져 페어링이 다른 이유로 실패할 수 있다.
#    적용 후 반드시 free heap 과 실제 페어링을 함께 확인할 것.
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=12
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=16
#  커미셔닝은 BLE 연결 1개면 충분하다(기본 3).
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
#  peripheral 전용 — central/observer 는 쓰지 않는다.
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
#  SED 는 메시지 버퍼가 많이 필요 없다.
CONFIG_OPENTHREAD_NUM_MESSAGE_BUFFERS=16
CONFIG_MDNS_TASK_STACK_SIZE=2048

# ═══ 2026-08-17 미사용 Matter 클러스터 제거 — DRAM 확보 ═══════════════
#  map 실측(build-esp32-h2/somfy_blinds.map)으로 DRAM 소비처를 뽑아보니
#  로그가 아니라 **쓰지도 않는 클러스터**가 자리를 먹고 있었다:
#      color-control 3,088B / level-control 1,616B / on-off 1,088B
#  이 기기는 window_covering 엔드포인트만 만든다(app_main.cpp).
#  → 조명용·무관 클러스터를 끄고 그 자리를 PacketBuffer 풀에 돌린다.
#  ※esp_matter 는 클러스터를 CONFIG_SUPPORT_*_CLUSTER 로 개별 선택한다
#    (ICD 때와 같은 메커니즘). 내부 참조가 있으면 링크가 깨지므로
#    빌드 실패 시 해당 항목만 되살릴 것.
# CONFIG_SUPPORT_COLOR_CONTROL_CLUSTER is not set
# CONFIG_SUPPORT_LEVEL_CONTROL_CLUSTER is not set
# CONFIG_SUPPORT_ON_OFF_CLUSTER is not set
CONFIG_SUPPORT_SCENES_CLUSTER=y  # ★Groups 가 참조 — 끄면 링크 실패(groups-server.cpp)
# CONFIG_SUPPORT_CAMERA_AV_STREAM_MANAGEMENT_CLUSTER is not set
# CONFIG_SUPPORT_SOIL_MEASUREMENT_CLUSTER is not set
# CONFIG_SUPPORT_BOOLEAN_STATE_CLUSTER is not set
# CONFIG_SUPPORT_ETHERNET_NETWORK_DIAGNOSTICS_CLUSTER is not set
# CONFIG_SUPPORT_JOINT_FABRIC_DATASTORE_CLUSTER is not set
# CONFIG_SUPPORT_JOINT_FABRIC_ADMINISTRATOR_CLUSTER is not set
# CONFIG_SUPPORT_TLS_CERTIFICATE_MANAGEMENT_CLUSTER is not set
# CONFIG_SUPPORT_ACTIONS_CLUSTER is not set
CONFIG_CHIP_TASK_STACK_SIZE=6144

# ★2026-08-25 절전 — RTOS IDLE 코드를 IRAM 으로.
#  C6 는 켜져 있는데 H2 만 빠져 있었다(보드별 오버레이 누락 계열).
#  IDF 설명: 약 180B 를 IRAM 에 올리는 대가로 **매 수면이 약 20us 길어진다.**
#  H2 실측 33.2회/초 기준 초당 0.66ms — 효과는 미미하지만 비용이 180B 뿐이고
#  위험이 없다. 두 보드 설정을 맞춘다는 의미도 있다.
CONFIG_PM_RTOS_IDLE_OPT=y

# ★★2026-08-25 절전 — light sleep 중 **플래시 전원 차단**.
#  IDF: "chip will try to power down flash as part of esp_light_sleep_start(),
#        which costs more time when chip wakes up."
#  전제 충족: SPIRAM 없음(depends on !SPIRAM).
#  ★부수 이득: 지금 켜둔 ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND 는 수면 중 Flash CS 를
#    풀업해 두는 대신 **수면 전류를 약 10uA 늘린다**. 플래시를 아예 내리면 그 누설
#    자체가 사라진다(워크어라운드는 그대로 둬도 무해).
#  ★위험: IDF 가 "there is a risk in powering down flash" 라고 명시한다. 깨어날 때
#    플래시 재초기화가 필요해 **회당 깨어있는 시간이 늘 수 있다** — 그러면 순이득이
#    없거나 마이너스다. 반드시 **깨어남 횟수가 아니라 깨어있는 시간**으로 판정할 것.
#    이상 동작(부팅 실패·랜덤 리셋)이 보이면 즉시 이 줄을 지운다.
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y

# ★★2026-08-25 CSL(Coordinated Sampled Listening) 켬 — Thread SSED 실험.
#  ★이것만으로는 동작이 안 바뀐다. 실제 스위치는 main/CHIPProjectConfig.h 의
#    CHIP_DEVICE_CONFIG_THREAD_SSED 이고, 그쪽 주석에 근거와 위험을 적어 뒀다.
#    (CHIP 이 otLinkSetCslPeriod 를 부르느냐 otLinkSetPollPeriod 를 부르느냐가 갈린다.)
#  위험: 부모(Thread 라우터)가 CSL 송신을 지원해야 한다. SmartThings 명령 수신이
#        늦거나 끊기면 이 줄과 CHIP_DEVICE_CONFIG_THREAD_SSED 를 함께 되돌릴 것.
# ★2026-08-25 되돌림 — 실기에서 SRP 타임아웃 반복 + Matter 통신 0건 + heap -25KB.
#   SmartThings 허브가 CSL 송신 미지원으로 보인다. 상세는 CHIPProjectConfig.h 주석.
# CONFIG_OPENTHREAD_CSL_ENABLE=y
